; domain
(define (domain drone-dom)

    (:requirements
        :strips :typing
    )

    (:types
        drone human box content location carrier num
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry-box ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
        (carrier-at ?c - carrier ?l - location)
        (carrier-has-box ?c ?b)
        (next ?n1 ?n2 - num)
        (carrier-n-boxes ?c - carrier ?n - num)
    )

    (:action move-carrier
        :parameters (?d - drone ?to ?from - location ?c - carrier)
        :precondition (and
            (drone-free ?d)
            (drone-at ?d ?from)
            (carrier-at ?c ?from)
        )
        :effect (and
            (not(carrier-at ?c ?from)); el carrier deja de estar en la localización
            (not(drone-at ?d ?from))
            (carrier-at ?c ?to)
            (drone-at ?d ?to)
        )
    )

    (:action move
       :parameters (?d - drone ?from ?to - location)
       :precondition (and 
           (drone-at ?d ?from)
       )
       :effect (and
           (drone-at ?d ?to) 
           (not (drone-at ?d ?from))
       )
    )

    (:action put-box-on-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;debe estar bajado el carrier
            (drone-carry-box ?d ?b) ;el dron tiene que tener la caja (haber hecho pick-up)
            (next ?n1 ?n2) ;no ha llegado al limite de capacidad
            (carrier-n-boxes ?c ?n1)
        )
        :effect (and
            (drone-free ?d)
            (not (drone-carry-box ?d ?b)) ;el dron deja de tener la caja
            (carrier-has-box ?c ?b) ;para tenerla el carrier
            (not (carrier-n-boxes ?c ?n1))
            (carrier-n-boxes ?c ?n2)
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry-box ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )

    (:action take-off-box-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;el carrier y el dron deben estar en el mismo sitio
            (carrier-has-box ?c ?b) ;la caja a coger la tiene que tener el carrier
            (drone-free ?d) ;el dron tiene que estar vacio
            (carrier-n-boxes ?c ?n2)
            (next ?n1 ?n2)
        )
        :effect (and
            (not(drone-free ?d))
            (drone-carry-box ?d ?b) ;el dron coge la caja, y
            (not(carrier-has-box ?c ?b)) ;el carrier ya no la tendrá
            (carrier-n-boxes ?c ?n1)
            (not(carrier-n-boxes ?c ?n2))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry-box ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry-box ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r1_l30_p30_c30_g30_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	box11 - box
	box12 - box
	box13 - box
	box14 - box
	box15 - box
	box16 - box
	box17 - box
	box18 - box
	box19 - box
	box20 - box
	box21 - box
	box22 - box
	box23 - box
	box24 - box
	box25 - box
	box26 - box
	box27 - box
	box28 - box
	box29 - box
	box30 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
	human8 - human
	human9 - human
	human10 - human
	human11 - human
	human12 - human
	human13 - human
	human14 - human
	human15 - human
	human16 - human
	human17 - human
	human18 - human
	human19 - human
	human20 - human
	human21 - human
	human22 - human
	human23 - human
	human24 - human
	human25 - human
	human26 - human
	human27 - human
	human28 - human
	human29 - human
	human30 - human
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(carrier-at carrier1 warehouse)
	(carrier-n-boxes carrier1 n0)
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-at box8 warehouse)
	(box-free box8)
	(box-at box9 warehouse)
	(box-free box9)
	(box-at box10 warehouse)
	(box-free box10)
	(box-at box11 warehouse)
	(box-free box11)
	(box-at box12 warehouse)
	(box-free box12)
	(box-at box13 warehouse)
	(box-free box13)
	(box-at box14 warehouse)
	(box-free box14)
	(box-at box15 warehouse)
	(box-free box15)
	(box-at box16 warehouse)
	(box-free box16)
	(box-at box17 warehouse)
	(box-free box17)
	(box-at box18 warehouse)
	(box-free box18)
	(box-at box19 warehouse)
	(box-free box19)
	(box-at box20 warehouse)
	(box-free box20)
	(box-at box21 warehouse)
	(box-free box21)
	(box-at box22 warehouse)
	(box-free box22)
	(box-at box23 warehouse)
	(box-free box23)
	(box-at box24 warehouse)
	(box-free box24)
	(box-at box25 warehouse)
	(box-free box25)
	(box-at box26 warehouse)
	(box-free box26)
	(box-at box27 warehouse)
	(box-free box27)
	(box-at box28 warehouse)
	(box-free box28)
	(box-at box29 warehouse)
	(box-free box29)
	(box-at box30 warehouse)
	(box-free box30)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 food)
	(box-has box6 food)
	(box-has box7 food)
	(box-has box8 food)
	(box-has box9 food)
	(box-has box10 food)
	(box-has box11 food)
	(box-has box12 food)
	(box-has box13 food)
	(box-has box14 food)
	(box-has box15 food)
	(box-has box16 food)
	(box-has box17 food)
	(box-has box18 food)
	(box-has box19 food)
	(box-has box20 food)
	(box-has box21 food)
	(box-has box22 food)
	(box-has box23 food)
	(box-has box24 food)
	(box-has box25 food)
	(box-has box26 food)
	(box-has box27 food)
	(box-has box28 meds)
	(box-has box29 meds)
	(box-has box30 meds)
	(human-at human1 loc11)
	(human-at human2 loc26)
	(human-at human3 loc24)
	(human-at human4 loc12)
	(human-at human5 loc25)
	(human-at human6 loc3)
	(human-at human7 loc15)
	(human-at human8 loc14)
	(human-at human9 loc20)
	(human-at human10 loc26)
	(human-at human11 loc24)
	(human-at human12 loc4)
	(human-at human13 loc28)
	(human-at human14 loc10)
	(human-at human15 loc9)
	(human-at human16 loc15)
	(human-at human17 loc14)
	(human-at human18 loc9)
	(human-at human19 loc17)
	(human-at human20 loc18)
	(human-at human21 loc18)
	(human-at human22 loc8)
	(human-at human23 loc29)
	(human-at human24 loc17)
	(human-at human25 loc2)
	(human-at human26 loc8)
	(human-at human27 loc6)
	(human-at human28 loc25)
	(human-at human29 loc8)
	(human-at human30 loc8)
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
)

(:goal (and
	(drone-at drone1 warehouse)
	(carrier-at carrier1 warehouse)
	(human-has human1 food)
	(human-has human2 food)
	(human-has human4 food)
	(human-has human5 food)
	(human-has human6 food)
	(human-has human7 food)
	(human-has human8 food)
	(human-has human9 food)
	(human-has human9 meds)
	(human-has human10 food)
	(human-has human10 meds)
	(human-has human11 food)
	(human-has human12 food)
	(human-has human13 food)
	(human-has human14 food)
	(human-has human15 food)
	(human-has human16 food)
	(human-has human17 food)
	(human-has human18 food)
	(human-has human18 meds)
	(human-has human20 food)
	(human-has human21 food)
	(human-has human22 food)
	(human-has human23 food)
	(human-has human24 food)
	(human-has human26 food)
	(human-has human27 food)
	(human-has human28 food)
	(human-has human29 food)
	(human-has human30 food)
	))
)

; plan
1. (pick-up drone1 box29 meds warehouse)
   deleted: (drone-free drone1) (box-at box29 warehouse)
   added: (drone-carry-box drone1 box29)
   goals met: 2 of 32
2. (move drone1 warehouse loc19)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc19)
   goals met: 1 of 32
3. (move drone1 loc19 loc20)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 loc20)
   goals met: 1 of 32
4. (drop drone1 box29 meds loc20 human9)
   deleted: (drone-carry-box drone1 box29) (box-free box29)
   added: (drone-free drone1) (box-at box29 loc20) (human-has human9 meds)
   goals met: 2 of 32
5. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 32
6. (pick-up drone1 box8 food warehouse)
   deleted: (drone-free drone1) (box-at box8 warehouse)
   added: (drone-carry-box drone1 box8)
   goals met: 3 of 32
7. (move drone1 warehouse loc26)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc26)
   goals met: 2 of 32
8. (drop drone1 box8 food loc26 human2)
   deleted: (drone-carry-box drone1 box8) (box-free box8)
   added: (drone-free drone1) (box-at box8 loc26) (human-has human2 food)
   goals met: 3 of 32
9. (move drone1 loc26 warehouse)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 32
10. (pick-up drone1 box28 meds warehouse)
   deleted: (drone-free drone1) (box-at box28 warehouse)
   added: (drone-carry-box drone1 box28)
   goals met: 4 of 32
11. (move drone1 warehouse loc26)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc26)
   goals met: 3 of 32
12. (drop drone1 box28 meds loc26 human10)
   deleted: (drone-carry-box drone1 box28) (box-free box28)
   added: (drone-free drone1) (box-at box28 loc26) (human-has human10 meds)
   goals met: 4 of 32
13. (move drone1 loc26 warehouse)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 32
14. (pick-up drone1 box19 food warehouse)
   deleted: (drone-free drone1) (box-at box19 warehouse)
   added: (drone-carry-box drone1 box19)
   goals met: 5 of 32
15. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 4 of 32
16. (drop drone1 box19 food loc9 human18)
   deleted: (drone-carry-box drone1 box19) (box-free box19)
   added: (drone-free drone1) (box-at box19 loc9) (human-has human18 food)
   goals met: 5 of 32
17. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 32
18. (pick-up drone1 box17 food warehouse)
   deleted: (drone-free drone1) (box-at box17 warehouse)
   added: (drone-carry-box drone1 box17)
   goals met: 6 of 32
19. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 5 of 32
20. (drop drone1 box17 food loc9 human15)
   deleted: (drone-carry-box drone1 box17) (box-free box17)
   added: (drone-free drone1) (box-at box17 loc9) (human-has human15 food)
   goals met: 6 of 32
21. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 32
22. (pick-up drone1 box30 meds warehouse)
   deleted: (drone-free drone1) (box-at box30 warehouse)
   added: (drone-carry-box drone1 box30)
   goals met: 7 of 32
23. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 6 of 32
24. (drop drone1 box30 meds loc9 human18)
   deleted: (drone-carry-box drone1 box30) (box-free box30)
   added: (drone-free drone1) (box-at box30 loc9) (human-has human18 meds)
   goals met: 7 of 32
25. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 32
26. (pick-up drone1 box14 food warehouse)
   deleted: (drone-free drone1) (box-at box14 warehouse)
   added: (drone-carry-box drone1 box14)
   goals met: 8 of 32
27. (move drone1 warehouse loc12)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 7 of 32
28. (drop drone1 box14 food loc12 human4)
   deleted: (drone-carry-box drone1 box14) (box-free box14)
   added: (drone-free drone1) (box-at box14 loc12) (human-has human4 food)
   goals met: 8 of 32
29. (move drone1 loc12 warehouse)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 32
30. (pick-up drone1 box24 food warehouse)
   deleted: (drone-free drone1) (box-at box24 warehouse)
   added: (drone-carry-box drone1 box24)
   goals met: 9 of 32
31. (move drone1 warehouse loc25)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc25)
   goals met: 8 of 32
32. (drop drone1 box24 food loc25 human28)
   deleted: (drone-carry-box drone1 box24) (box-free box24)
   added: (drone-free drone1) (box-at box24 loc25) (human-has human28 food)
   goals met: 9 of 32
33. (move drone1 loc25 warehouse)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 32
34. (pick-up drone1 box21 food warehouse)
   deleted: (drone-free drone1) (box-at box21 warehouse)
   added: (drone-carry-box drone1 box21)
   goals met: 10 of 32
35. (move drone1 warehouse loc25)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc25)
   goals met: 9 of 32
36. (drop drone1 box21 food loc25 human5)
   deleted: (drone-carry-box drone1 box21) (box-free box21)
   added: (drone-free drone1) (box-at box21 loc25) (human-has human5 food)
   goals met: 10 of 32
37. (move drone1 loc25 warehouse)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 32
38. (pick-up drone1 box13 food warehouse)
   deleted: (drone-free drone1) (box-at box13 warehouse)
   added: (drone-carry-box drone1 box13)
   goals met: 11 of 32
39. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 10 of 32
40. (drop drone1 box13 food loc3 human6)
   deleted: (drone-carry-box drone1 box13) (box-free box13)
   added: (drone-free drone1) (box-at box13 loc3) (human-has human6 food)
   goals met: 11 of 32
41. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 32
42. (pick-up drone1 box25 food warehouse)
   deleted: (drone-free drone1) (box-at box25 warehouse)
   added: (drone-carry-box drone1 box25)
   goals met: 12 of 32
43. (move drone1 warehouse loc15)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 11 of 32
44. (drop drone1 box25 food loc15 human16)
   deleted: (drone-carry-box drone1 box25) (box-free box25)
   added: (drone-free drone1) (box-at box25 loc15) (human-has human16 food)
   goals met: 12 of 32
45. (move drone1 loc15 warehouse)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 32
46. (pick-up drone1 box5 food warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry-box drone1 box5)
   goals met: 13 of 32
47. (move drone1 warehouse loc15)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 12 of 32
48. (drop drone1 box5 food loc15 human7)
   deleted: (drone-carry-box drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc15) (human-has human7 food)
   goals met: 13 of 32
49. (move drone1 loc15 warehouse)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 32
50. (pick-up drone1 box6 food warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry-box drone1 box6)
   goals met: 14 of 32
51. (move drone1 warehouse loc14)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 13 of 32
52. (drop drone1 box6 food loc14 human17)
   deleted: (drone-carry-box drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc14) (human-has human17 food)
   goals met: 14 of 32
53. (move drone1 loc14 warehouse)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 32
54. (pick-up drone1 box23 food warehouse)
   deleted: (drone-free drone1) (box-at box23 warehouse)
   added: (drone-carry-box drone1 box23)
   goals met: 15 of 32
55. (move drone1 warehouse loc14)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 14 of 32
56. (drop drone1 box23 food loc14 human8)
   deleted: (drone-carry-box drone1 box23) (box-free box23)
   added: (drone-free drone1) (box-at box23 loc14) (human-has human8 food)
   goals met: 15 of 32
57. (move drone1 loc14 warehouse)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 32
58. (pick-up drone1 box16 food warehouse)
   deleted: (drone-free drone1) (box-at box16 warehouse)
   added: (drone-carry-box drone1 box16)
   goals met: 16 of 32
59. (move drone1 warehouse loc20)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc20)
   goals met: 15 of 32
60. (drop drone1 box16 food loc20 human9)
   deleted: (drone-carry-box drone1 box16) (box-free box16)
   added: (drone-free drone1) (box-at box16 loc20) (human-has human9 food)
   goals met: 16 of 32
61. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 32
62. (pick-up drone1 box9 food warehouse)
   deleted: (drone-free drone1) (box-at box9 warehouse)
   added: (drone-carry-box drone1 box9)
   goals met: 17 of 32
63. (move drone1 warehouse loc26)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc26)
   goals met: 16 of 32
64. (drop drone1 box9 food loc26 human10)
   deleted: (drone-carry-box drone1 box9) (box-free box9)
   added: (drone-free drone1) (box-at box9 loc26) (human-has human10 food)
   goals met: 17 of 32
65. (move drone1 loc26 warehouse)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 32
66. (pick-up drone1 box18 food warehouse)
   deleted: (drone-free drone1) (box-at box18 warehouse)
   added: (drone-carry-box drone1 box18)
   goals met: 18 of 32
67. (move drone1 warehouse loc11)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 17 of 32
68. (drop drone1 box18 food loc11 human1)
   deleted: (drone-carry-box drone1 box18) (box-free box18)
   added: (drone-free drone1) (box-at box18 loc11) (human-has human1 food)
   goals met: 18 of 32
69. (move drone1 loc11 loc9)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 loc9)
   goals met: 18 of 32
70. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 19 of 32
71. (pick-up drone1 box10 food warehouse)
   deleted: (drone-free drone1) (box-at box10 warehouse)
   added: (drone-carry-box drone1 box10)
   goals met: 19 of 32
72. (move drone1 warehouse loc24)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc24)
   goals met: 18 of 32
73. (drop drone1 box10 food loc24 human11)
   deleted: (drone-carry-box drone1 box10) (box-free box10)
   added: (drone-free drone1) (box-at box10 loc24) (human-has human11 food)
   goals met: 19 of 32
74. (move drone1 loc24 warehouse)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 32
75. (move-carrier drone1 loc23 warehouse carrier1)
   deleted: (carrier-at carrier1 warehouse) (drone-at drone1 warehouse)
   added: (carrier-at carrier1 loc23) (drone-at drone1 loc23)
   goals met: 18 of 32
76. (move drone1 loc23 warehouse)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 warehouse)
   goals met: 19 of 32
77. (pick-up drone1 box7 food warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry-box drone1 box7)
   goals met: 19 of 32
78. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 18 of 32
79. (drop drone1 box7 food loc4 human12)
   deleted: (drone-carry-box drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc4) (human-has human12 food)
   goals met: 19 of 32
80. (move drone1 loc4 loc23)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 loc23)
   goals met: 19 of 32
81. (move-carrier drone1 warehouse loc23 carrier1)
   deleted: (carrier-at carrier1 loc23) (drone-at drone1 loc23)
   added: (carrier-at carrier1 warehouse) (drone-at drone1 warehouse)
   goals met: 21 of 32
82. (pick-up drone1 box26 food warehouse)
   deleted: (drone-free drone1) (box-at box26 warehouse)
   added: (drone-carry-box drone1 box26)
   goals met: 21 of 32
83. (move drone1 warehouse loc10)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc10)
   goals met: 20 of 32
84. (drop drone1 box26 food loc10 human14)
   deleted: (drone-carry-box drone1 box26) (box-free box26)
   added: (drone-free drone1) (box-at box26 loc10) (human-has human14 food)
   goals met: 21 of 32
85. (move drone1 loc10 warehouse)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 warehouse)
   goals met: 22 of 32
86. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry-box drone1 box4)
   goals met: 22 of 32
87. (move drone1 warehouse loc18)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 21 of 32
88. (drop drone1 box4 food loc18 human20)
   deleted: (drone-carry-box drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc18) (human-has human20 food)
   goals met: 22 of 32
89. (move drone1 loc18 warehouse)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 warehouse)
   goals met: 23 of 32
90. (pick-up drone1 box12 food warehouse)
   deleted: (drone-free drone1) (box-at box12 warehouse)
   added: (drone-carry-box drone1 box12)
   goals met: 23 of 32
91. (move drone1 warehouse loc18)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 22 of 32
92. (drop drone1 box12 food loc18 human21)
   deleted: (drone-carry-box drone1 box12) (box-free box12)
   added: (drone-free drone1) (box-at box12 loc18) (human-has human21 food)
   goals met: 23 of 32
93. (move drone1 loc18 loc9)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 loc9)
   goals met: 23 of 32
94. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 24 of 32
95. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry-box drone1 box3)
   goals met: 24 of 32
96. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 23 of 32
97. (drop drone1 box3 food loc8 human30)
   deleted: (drone-carry-box drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc8) (human-has human30 food)
   goals met: 24 of 32
98. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 25 of 32
99. (pick-up drone1 box15 food warehouse)
   deleted: (drone-free drone1) (box-at box15 warehouse)
   added: (drone-carry-box drone1 box15)
   goals met: 25 of 32
100. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 24 of 32
101. (drop drone1 box15 food loc8 human29)
   deleted: (drone-carry-box drone1 box15) (box-free box15)
   added: (drone-free drone1) (box-at box15 loc8) (human-has human29 food)
   goals met: 25 of 32
102. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 26 of 32
103. (pick-up drone1 box20 food warehouse)
   deleted: (drone-free drone1) (box-at box20 warehouse)
   added: (drone-carry-box drone1 box20)
   goals met: 26 of 32
104. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 25 of 32
105. (drop drone1 box20 food loc8 human26)
   deleted: (drone-carry-box drone1 box20) (box-free box20)
   added: (drone-free drone1) (box-at box20 loc8) (human-has human26 food)
   goals met: 26 of 32
106. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 27 of 32
107. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry-box drone1 box1)
   goals met: 27 of 32
108. (move drone1 warehouse loc8)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 26 of 32
109. (drop drone1 box1 food loc8 human22)
   deleted: (drone-carry-box drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc8) (human-has human22 food)
   goals met: 27 of 32
110. (move drone1 loc8 warehouse)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 28 of 32
111. (pick-up drone1 box27 food warehouse)
   deleted: (drone-free drone1) (box-at box27 warehouse)
   added: (drone-carry-box drone1 box27)
   goals met: 28 of 32
112. (move drone1 warehouse loc29)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc29)
   goals met: 27 of 32
113. (drop drone1 box27 food loc29 human23)
   deleted: (drone-carry-box drone1 box27) (box-free box27)
   added: (drone-free drone1) (box-at box27 loc29) (human-has human23 food)
   goals met: 28 of 32
114. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 29 of 32
115. (pick-up drone1 box11 food warehouse)
   deleted: (drone-free drone1) (box-at box11 warehouse)
   added: (drone-carry-box drone1 box11)
   goals met: 29 of 32
116. (move drone1 warehouse loc17)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc17)
   goals met: 28 of 32
117. (drop drone1 box11 food loc17 human24)
   deleted: (drone-carry-box drone1 box11) (box-free box11)
   added: (drone-free drone1) (box-at box11 loc17) (human-has human24 food)
   goals met: 29 of 32
118. (move drone1 loc17 warehouse)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 warehouse)
   goals met: 30 of 32
119. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry-box drone1 box2)
   goals met: 30 of 32
120. (move drone1 warehouse loc6)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 29 of 32
121. (drop drone1 box2 food loc6 human27)
   deleted: (drone-carry-box drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc6) (human-has human27 food)
   goals met: 30 of 32
122. (move drone1 loc6 warehouse)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 31 of 32
123. (pick-up drone1 box22 food warehouse)
   deleted: (drone-free drone1) (box-at box22 warehouse)
   added: (drone-carry-box drone1 box22)
   goals met: 31 of 32
124. (move drone1 warehouse loc28)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc28)
   goals met: 30 of 32
125. (drop drone1 box22 food loc28 human13)
   deleted: (drone-carry-box drone1 box22) (box-free box22)
   added: (drone-free drone1) (box-at box22 loc28) (human-has human13 food)
   goals met: 31 of 32
126. (move drone1 loc28 loc18)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 loc18)
   goals met: 31 of 32
127. (move drone1 loc18 loc19)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 loc19)
   goals met: 31 of 32
128. (move drone1 loc19 warehouse)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 warehouse)
   goals met: 32 of 32
